Al-Nafuur/United-Carts-of-Atari/source/STM32firmware/PlusCart/Src/main.c
				}

			}else{
				menu_status = select_wifi_network;
				make_menu_entry(&dst, MENU_TEXT_GO_BACK, Leave_Menu);
				if( esp8266_wifi_list( &dst, &num_menu_entries) == false){
		    		return esp_timeout;
		    	}
			}
		}

		else if( strncmp(&curPath[sizeof(MENU_TEXT_SETUP)], MENU_TEXT_TV_MODE_SETUP, sizeof(MENU_TEXT_TV_MODE_SETUP) - 1) == 0 ){
			if(d->type == Menu_Action){

				uint8_t new_tv_mode = TV_MODE_NTSC;
				while ( strcmp(&curPath[sizeof(MENU_TEXT_SETUP) + 2 + sizeof(MENU_TEXT_TV_MODE_SETUP)],
						&tvModes[new_tv_mode][2]) != 0)
					new_tv_mode++;

				set_tv_mode(new_tv_mode);
				if(user_settings.tv_mode != new_tv_mode){
					user_settings.tv_mode = new_tv_mode;
					flash_set_eeprom_user_settings(user_settings);
				}
	        	curPath[0] = '\0';
			}else{

				make_menu_entry(&dst, MENU_TEXT_GO_BACK, Leave_Menu);


				for (int tv = 1; tv < sizeof tvModes / sizeof *tvModes; tv++) {
					char tvLine[33];
					strcpy(tvLine, tvModes[tv]);
					if (user_settings.tv_mode == tv)
						tvLine[0] = CHAR_SELECTION;
					make_menu_entry(&dst, tvLine, Menu_Action);
				}
			}

		}

		else if( strncmp(&curPath[sizeof(MENU_TEXT_SETUP)], MENU_TEXT_FONT_SETUP, sizeof(MENU_TEXT_FONT_SETUP) - 1) == 0 ){
			if(d->type == Menu_Action){

				uint8_t new_font_style = 0;
				while ( strcmp(&curPath[sizeof(MENU_TEXT_SETUP) + 2 + sizeof(MENU_TEXT_FONT_SETUP)],
						&menuFontNames[new_font_style][2]) != 0)
					new_font_style++;

				//set_my_font(new_font_style);

				if(user_settings.font_style != new_font_style){
					user_settings.font_style = new_font_style;
					flash_set_eeprom_user_settings(user_settings);
				}
	        	curPath[0] = '\0';
			}else{
				make_menu_entry(&dst, MENU_TEXT_GO_BACK, Leave_Menu);

				uint8_t fontCount = sizeof menuFontNames / sizeof *menuFontNames;
				char fontLine[fontCount][33];
				for (uint8_t font=0; font < fontCount; font++) {
					strcpy(fontLine[font], menuFontNames[font]);
					fontLine[font][0] = user_settings.font_style == font ? CHAR_SELECTION: ' ';

					//set_my_font(font);
					make_menu_entry_font(&dst,
							fontLine[font],
							Menu_Action,
							font);
				}
				//set_my_font(user_settings.font_style);
			}

		}

		else if(strncmp(&curPath[sizeof(MENU_TEXT_SETUP)], MENU_TEXT_PLUS_CONNECT, sizeof(MENU_TEXT_PLUS_CONNECT) - 1) == 0 ){
			if(d->type == Menu_Action){ // if actual Entry is of type Menu_Action -> Connect user

				strcat(curPath,"0000000000");

				if( esp8266_PlusStore_API_connect() == false){
					return esp_timeout;
				}
				esp8266_PlusStore_API_prepare_request_header(curPath, false, true );
	        	esp8266_print(http_request_header);
	        	esp8266_skip_http_response_header();
	        	while(HAL_UART_Receive(&huart1, &c, 1, 100 ) == HAL_OK){}
	        	if(c == '0'){
	        		menu_status = plus_connect_failed;
	        	}else if(c == '1'){
	        		menu_status = plus_created;
	        	}else{
	        		menu_status = plus_connected;
	        	}

	        	esp8266_PlusStore_API_end_transmission();

	        	curPath[0] = '\0';
			}else{
				if(strcmp(&curPath[sizeof(MENU_TEXT_SETUP)], MENU_TEXT_PLUS_CONNECT) == 0){
					menu_status = plus_connect;
				}
				make_keyboard(&dst, KEYBOARD_UPPERCASE);
			}
		}

		else if(strncmp(&curPath[sizeof(MENU_TEXT_SETUP)], MENU_TEXT_PLUS_REMOVE, sizeof(MENU_TEXT_PLUS_REMOVE) - 1) == 0 ){
			if( esp8266_PlusStore_API_connect() == false){
				return esp_timeout;
			}
			esp8266_PlusStore_API_prepare_request_header(curPath, false, true );
        	esp8266_print(http_request_header);

            esp8266_skip_http_response_header();
        	while(HAL_UART_Receive(&huart1, &c, 1, 100 ) == HAL_OK){}
        	if(c == '0'){
        		menu_status = plus_connect_failed;
        	}else{
        		menu_status = plus_removed;
        	}

        	esp8266_PlusStore_API_end_transmission();

        	curPath[0] = '\0';
		}

		else if(strncmp(&curPath[sizeof(MENU_TEXT_SETUP)], MENU_TEXT_OFFLINE_ROM_UPDATE, sizeof(MENU_TEXT_OFFLINE_ROM_UPDATE) - 1) == 0 ){
			if( flash_download("&r=1", d->filesize , 0 , false ) != DOWNLOAD_AREA_START_ADDRESS){
		    	menu_status = download_failed;
			}else{
	    		menu_status = done;
	        	curPath[0] = '\0';
			}
		}

		else if(strncmp(&curPath[sizeof(MENU_TEXT_SETUP)], MENU_TEXT_DELETE_OFFLINE_ROMS, sizeof(MENU_TEXT_DELETE_OFFLINE_ROMS) - 1) == 0 ){
			flash_erase_storage((uint8_t)FLASH_SECTOR_5);
			user_settings.first_free_flash_sector = (uint8_t) FLASH_SECTOR_5;
		    flash_set_eeprom_user_settings(user_settings);
    		menu_status = offline_roms_deleted;
        	curPath[0] = '\0';
		}

		else if(strncmp(&curPath[sizeof(MENU_TEXT_SETUP)], MENU_TEXT_DETECT_OFFLINE_ROMS, sizeof(MENU_TEXT_DELETE_OFFLINE_ROMS) - 1) == 0 ){
			uint32_t last_address = flash_check_offline_roms_size();
			if(last_address > DOWNLOAD_AREA_START_ADDRESS + 1024){
			    user_settings.first_free_flash_sector = ((last_address - ADDR_FLASH_SECTOR_5) / 0x20000 ) + 6;
			    flash_set_eeprom_user_settings(user_settings);
	    		menu_status = offline_roms_detected;
			}else{
	    		menu_status = no_offline_roms_detected;
			}
    		num_menu_entries = 0;
        	curPath[0] = '\0';
		}

		else if(strncmp(&curPath[sizeof(MENU_TEXT_SETUP)], MENU_TEXT_WPS_CONNECT, sizeof(MENU_TEXT_WPS_CONNECT) - 1) == 0 ){
	    	if(esp8266_wps_connect()){
	        	menu_status = wifi_connected;
	    	}else{
	        	menu_status = wifi_not_connected;
	    	}
			curPath[0] = '\0';
			HAL_Delay(2000);
		}

		else if(strncmp(&curPath[sizeof(MENU_TEXT_SETUP)], MENU_TEXT_WIFI_MANGER, sizeof(MENU_TEXT_WIFI_MANGER) - 1) == 0 ){
			menu_status = done;
			esp8266_AT_WiFiManager();
	    	curPath[0] = '\0';
		}

		else if(strncmp(&curPath[sizeof(MENU_TEXT_SETUP)], MENU_TEXT_ESP8266_RESTORE, sizeof(MENU_TEXT_ESP8266_RESTORE) - 1) == 0 ){
	    	if(esp8266_reset(true)){
	        	menu_status = done;
	    	}else{
	        	menu_status = failed;
	    	}
			curPath[0] = '\0';
		}

		else if(strncmp(&curPath[sizeof(MENU_TEXT_SETUP)], MENU_TEXT_PRIVATE_KEY, sizeof(MENU_TEXT_PRIVATE_KEY) - 1) == 0 ){
			if(d->type == Menu_Action){ // if actual Entry is of type Menu_Action -> Save Private key
				menu_status = private_key_saved;
	        	curPath[0] = '\0';
			}else{
				if(strcmp(&curPath[sizeof(MENU_TEXT_SETUP)], MENU_TEXT_PRIVATE_KEY ) == 0){
					menu_status = private_key;
				}
				make_keyboard(&dst, KEYBOARD_UPPERCASE);
			}
		}
	}else if(strncmp(MENU_TEXT_OFFLINE_ROMS, curPath, sizeof(MENU_TEXT_OFFLINE_ROMS) - 1) == 0 ){
		make_menu_entry(&dst, "..", Leave_Menu);
		flash_file_list(&curPath[sizeof(MENU_TEXT_OFFLINE_ROMS) - 1], &dst, &num_menu_entries);
	}

