Al-Nafuur/United-Carts-of-Atari/source/STM32firmware/PlusCart/Src/main.c
  /* Infinite loop */
  /* USER CODE BEGIN WHILE */
  while (1){
    int ret = emulate_firmware_cartridge();
    enum e_status_message menu_status = none, main_status = none;
    if (ret == CART_CMD_ROOT_DIR){
	  system_secondary_init();

	  d->type = Root_Menu;
      d->filesize = 0;

   	  input_field[0] = 0;
      curPath[0] = 0;
      menu_status = buildMenuFromPath( d );
    } else if(ret == CART_CMD_PAGE_DOWN ) {
    	act_page--;
    } else if(ret == CART_CMD_PAGE_UP ) {
    	act_page++;
    } else {
    	ret += act_page * NUM_MENU_ITEMS_PER_PAGE;
      d = &menu_entries[ret];
      if (d->type == Cart_File || d->type == Offline_Cart_File){
    	// selection is a rom file
    	uint32_t max_romsize = (((BUFFER_SIZE + CCM_RAM_SIZE) * 1024) + (12 - user_settings.first_free_flash_sector) * 128 * 1024 );
    	if(d->filesize > max_romsize ){
    		main_status = not_enough_menory;
    	}else{
    		CART_TYPE cart_type = identify_cartridge(d);
            HAL_Delay(200);
            if (cart_type.base_type == base_type_ACE){
            	main_status = romtype_ACE_unsupported;
            }else if (cart_type.base_type != base_type_None){
                emulate_cartridge(cart_type, d);
                set_menu_status_byte(StatusByteReboot, 0);
                main_status = exit_emulation;
                if(d->filesize > (BUFFER_SIZE * 1024)){ // reload menu
                	truncate_curPath();
                    menu_status = buildMenuFromPath( d );
                }
            }else{
            	main_status = romtype_unknown;
            }
    	}

    	truncate_curPath();

      } else {
        // selection is a directory or Menu_Action, or Keyboard_Char
  		if (d->type == Leave_Menu){
  		  // go back clear_curPath();//
  		  truncate_curPath();
  		  input_field[0] = 0; // Reset Keyboard input field
  		}

  		else if (d->type == Leave_SubKeyboard_Menu) {
  			main_status = keyboard_input;
  			// nothing!
  		}

  		else if(d->type == Delete_Keyboard_Char){
    		  int len = strlen(curPath);
    		  if(len && curPath[--len] != PATH_SEPERATOR ){
    	  		  curPath[len] = 0;
    		  }
    		  len = strlen((char *) input_field);
    		  if(len){
    			  input_field[--len] = 0;
    		  }
  	    	  main_status = keyboard_input;
  		} else {
  		  // go into Menu TODO find better way for separation of first keyboard char!!
  		  if( ( d->type != Keyboard_Char && strlen(curPath) > 0)
  			   || strcmp(MENU_TEXT_SETUP"/"MENU_TEXT_PLUS_CONNECT, curPath) == 0
			   || strcmp(MENU_TEXT_SEARCH_ROM, curPath) == 0 ){
    		    strcat(curPath, "/");
  		  }

  		  if (!strcmp(d->entryname, MENU_TEXT_SPACE))
  			  strcpy(d->entryname, " ");

  		  if ( d->type != Keyboard_Extend )
   			  append_entry_to_path(d);

  		  if(d->type == Keyboard_Char){
  			  strcat((char *)input_field, d->entryname);
  			  if(strlen((char *)input_field) > STATUS_MESSAGE_LENGTH){
  	  			  for(int i = 0 ; i < STATUS_MESSAGE_LENGTH; i++){
  	  				input_field[i] = input_field[i + 1];
  	  			  }
  			  }
  	    	  main_status = keyboard_input;
  		  }else {
  	  		  if(d->type == Menu_Action){
  	  			  input_field[0] = 0;
  	  		  }
  		  }
  	    }
  		menu_status = buildMenuFromPath( d );
      }
    }

    // Menu status message and PageType byte
    main_status = (main_status != none)?main_status:menu_status;
    if(main_status == keyboard_input){
    	set_menu_status_msg((char *)input_field);
    	set_menu_status_byte((uint8_t)PageType, (char)Keyboard);
    }else{
    	if(main_status != none){
        	set_menu_status_msg(status_message[main_status]);
    	}
    	if(act_page > (num_menu_entries / NUM_MENU_ITEMS_PER_PAGE) ){
    		act_page = 0;
    	}
    	set_menu_status_byte(PageType, Directory);
    }
    bool paging_required = (main_status == paging);
    bool is_connected = esp8266_is_connected();

    createMenuForAtari( menu_entries, act_page, num_menu_entries, paging_required, is_connected, plus_store_status );
    HAL_Delay(200);
    /* USER CODE END WHILE */

    /* USER CODE BEGIN 3 */
  }
  /* USER CODE END 3 */
}

/**
  * @brief System Clock Configuration
  * @retval None
  */
void SystemClock_Config(void)
{
  RCC_OscInitTypeDef RCC_OscInitStruct = {0};
  RCC_ClkInitTypeDef RCC_ClkInitStruct = {0};

  /** Configure the main internal regulator output voltage 
  */
  __HAL_RCC_PWR_CLK_ENABLE();
  __HAL_PWR_VOLTAGESCALING_CONFIG(PWR_REGULATOR_VOLTAGE_SCALE1);
  /** Initializes the CPU, AHB and APB busses clocks 
  */
  RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_HSI;
  RCC_OscInitStruct.HSIState = RCC_HSI_ON;
  RCC_OscInitStruct.HSICalibrationValue = RCC_HSICALIBRATION_DEFAULT;
  RCC_OscInitStruct.PLL.PLLState = RCC_PLL_ON;
  RCC_OscInitStruct.PLL.PLLSource = RCC_PLLSOURCE_HSI;
  RCC_OscInitStruct.PLL.PLLM = 16;
  RCC_OscInitStruct.PLL.PLLN = 432;
  RCC_OscInitStruct.PLL.PLLP = RCC_PLLP_DIV2;
  RCC_OscInitStruct.PLL.PLLQ = 7;
  if (HAL_RCC_OscConfig(&RCC_OscInitStruct) != HAL_OK)
  {
    Error_Handler();
  }
  /** Initializes the CPU, AHB and APB busses clocks 
  */
  RCC_ClkInitStruct.ClockType = RCC_CLOCKTYPE_HCLK|RCC_CLOCKTYPE_SYSCLK
                              |RCC_CLOCKTYPE_PCLK1|RCC_CLOCKTYPE_PCLK2;
  RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_PLLCLK;
  RCC_ClkInitStruct.AHBCLKDivider = RCC_SYSCLK_DIV1;
  RCC_ClkInitStruct.APB1CLKDivider = RCC_HCLK_DIV4;
  RCC_ClkInitStruct.APB2CLKDivider = RCC_HCLK_DIV2;

  if (HAL_RCC_ClockConfig(&RCC_ClkInitStruct, FLASH_LATENCY_5) != HAL_OK)
  {
    Error_Handler();
  }
}

/**
  * @brief USART1 Initialization Function
  * @param None
  * @retval None
  */
static void MX_USART1_UART_Init(void)
{

  /* USER CODE BEGIN USART1_Init 0 */

  /* USER CODE END USART1_Init 0 */

  /* USER CODE BEGIN USART1_Init 1 */
	  __HAL_RCC_GPIOA_CLK_ENABLE();

  /* USER CODE END USART1_Init 1 */
  huart1.Instance = USART1;
  huart1.Init.BaudRate = 115200;
  huart1.Init.WordLength = UART_WORDLENGTH_8B;
  huart1.Init.StopBits = UART_STOPBITS_1;
  huart1.Init.Parity = UART_PARITY_NONE;
  huart1.Init.Mode = UART_MODE_TX_RX;
  huart1.Init.HwFlowCtl = UART_HWCONTROL_NONE;
  huart1.Init.OverSampling = UART_OVERSAMPLING_16;
  if (HAL_UART_Init(&huart1) != HAL_OK)
  {
    Error_Handler();
  }
  /* USER CODE BEGIN USART1_Init 2 */

  /* USER CODE END USART1_Init 2 */

